; domain
(define (domain moka_robo_barista_two)

(:requirements :strips )

(:predicates
    (HAND ?h) ;robot hand
    (CONTAINER ?c) ;container for coffee
    (ADDON ?a) ; additional stuff for your coffee
    (LOCATION ?l)   ;locations
    (POT ?p)    ;pot
    (CUP ?c) ; cup

    (is-free ?h) ; if hand is free
    (has-spoon ?h) ;if one of the hands holds spoon

    
    (for-water ?c) ;container meant for storing water
    (has-water ?c) ;whether an object has water
    (has-beans ?c) ;whether a container has beans
    (is-empty ?c) ;if container is empty
    (is-open ?c)  ;if container is open
    (at ?l ?c) ; represents where the container is

    
    ;Location predicate
    (is-drawer ?l)
    (is-closed ?l)
    (is-table ?l)
    (is-grinder ?l)
    (is-stove ?l)

    ;coffee predicates
    (has-flavor ?c ?a)       

    ;pot predicates 
    (has-coffee ?p)
    (is-screwed ?p)
    (has-filter ?p)
    (coffee-is-ready ?p)
    (coffee-is-distributed-evenly ?p)

)

; action for drawers
(:action open-drawer
    ;Robot arms opens drawer
    :parameters (?l ?h)
    :precondition (and (LOCATION ?l) (is-drawer ?l) (is-closed ?l)
                       (HAND ?h) (is-free ?h))
    :effect (and (not (is-closed ?l)))
)

(:action close-drawer
    ;Robot closes  drawer
    :parameters (?l ?h)
    :precondition (and (LOCATION ?l) (is-drawer ?l) (not (is-closed ?l))
                       (HAND ?h) (is-free ?h))
    :effect (and (is-closed ?l))
)

; MOVING OBJECTS

(:action take-object-up-from-drawer
    ; Robot's arm takes object from drawer
    :parameters (?h ?l ?c)
    :precondition (and (HAND ?h) (is-free ?h)
                       (LOCATION ?l) (is-drawer ?l) (not (is-closed ?l))
                       (CONTAINER ?c) (at ?l ?c)
                       )
    :effect (and (not (is-free ?h)) (at ?h ?c) (not (at ?l ?c)))
)

(:action put-object-down-to-drawer
    ; Robot's arm puts object to drawer
    :parameters (?h ?l ?c)
    :precondition (and (HAND ?h) (not (is-free ?h))
                       (LOCATION ?l) (is-drawer ?l) (not (is-closed ?l))
                       (CONTAINER ?c) (at ?h ?c) 
                       )
    :effect (and (is-free ?h) (not (at ?h ?c)) (at ?l ?c))
)


(:action take-cup-up-from-drawer
    ; Robot's arm takes object from drawer
    :parameters (?h ?l ?c)
    :precondition (and (HAND ?h) (is-free ?h)
                       (LOCATION ?l) (is-drawer ?l) (not (is-closed ?l))
                       (CUP ?c) (at ?l ?c)
                       )
    :effect (and (not (is-free ?h)) (at ?h ?c) (not (at ?l ?c)))
)

(:action put-cup-down-to-drawer
    ; Robot's arm puts object to drawer
    :parameters (?h ?l ?c)
    :precondition (and (HAND ?h) (not (is-free ?h))
                       (LOCATION ?l) (is-drawer ?l) (not (is-closed ?l))
                       (CUP ?c) (at ?h ?c) 
                       )
    :effect (and (is-free ?h) (not (at ?h ?c)) (at ?l ?c))
)


(:action take-pot-up-from-drawer
    ; Robot's arm takes pot from drawer
    :parameters (?h ?l ?p)
    :precondition (and (HAND ?h) (is-free ?h)
                       (LOCATION ?l) (is-drawer ?l) (not (is-closed ?l))
                       (POT ?p) (at ?l ?p)
                       )
    :effect (and (not (is-free ?h)) (at ?h ?p) (not (at ?l ?p)))
)

(:action put-pot-down-to-drawer
    ; Robot's arm takes pot to drawer
    :parameters (?h ?l ?p)
    :precondition (and (HAND ?h) (not (is-free ?h))
                       (LOCATION ?l) (is-drawer ?l) (not (is-closed ?l))
                       (POT ?p) (at ?h ?p) 
                       )
    :effect (and (is-free ?h) (not (at ?h ?p)) (at ?l ?p))
)

(:action take-object-up-from
    ; Robot's arm takes object from location (not drawer)
    :parameters (?h ?l ?c)
    :precondition (and (HAND ?h) (is-free ?h)
                       (LOCATION ?l) (not (is-drawer ?l))
                       (CONTAINER ?c) (at ?l ?c)
                       )
    :effect (and (not (is-free ?h)) (at ?h ?c) (not (at ?l ?c)) )
)
    
(:action put-object-down-to
    ; Robot's arm puts object to location (not drawer)
    :parameters (?h ?l ?c)
    :precondition (and (HAND ?h) (not (is-free ?h))
                       (LOCATION ?l) (not (is-drawer ?l)) (not (is-stove ?l))
                       (CONTAINER ?c) (at ?h ?c)
                       )
    :effect (and (is-free ?h) (not (at ?h ?c)) (at ?l ?c))
)


(:action take-addon-up-from
    ; Robot's arm takes object from location (not drawer)
    :parameters (?h ?l ?c)
    :precondition (and (HAND ?h) (is-free ?h)
                       (LOCATION ?l) (not (is-drawer ?l))
                       (ADDON ?c) (at ?l ?c)
                       )
    :effect (and (not (is-free ?h)) (at ?h ?c) (not (at ?l ?c)) )
)
    
(:action put-addon-down-to
    ; Robot's arm puts object to location (not drawer)
    :parameters (?h ?l ?c)
    :precondition (and (HAND ?h) (not (is-free ?h))
                       (LOCATION ?l) (not (is-drawer ?l)) (not (is-stove ?l))
                       (ADDON ?c) (at ?h ?c)
                       )
    :effect (and (is-free ?h) (not (at ?h ?c)) (at ?l ?c))
)


(:action take-cup-up-from
    ; Robot's arm takes object from location (not drawer)
    :parameters (?h ?l ?c)
    :precondition (and (HAND ?h) (is-free ?h)
                       (LOCATION ?l) (not (is-drawer ?l))
                       (CUP ?c) (at ?l ?c)
                       )
    :effect (and (not (is-free ?h)) (at ?h ?c) (not (at ?l ?c)) )
)
    
(:action put-cup-down-to
    ; Robot's arm puts object to location (not drawer)
    :parameters (?h ?l ?c)
    :precondition (and (HAND ?h) (not (is-free ?h))
                       (LOCATION ?l) (not (is-drawer ?l)) (not (is-stove ?l))
                       (CUP ?c) (at ?h ?c)
                       )
    :effect (and (is-free ?h) (not (at ?h ?c)) (at ?l ?c))
)



(:action take-pot-up-from
    ; Robot's arm takes object from location (not drawer)
    :parameters (?h ?l ?c)
    :precondition (and (HAND ?h) (is-free ?h)
                       (LOCATION ?l) (not (is-drawer ?l))
                       (POT ?c) (at ?l ?c)
                       )
    :effect (and (not (is-free ?h)) (at ?h ?c) (not (at ?l ?c)) )
)
    
(:action put-pot-down-to
    ; Robot's arm puts object to location (not drawer)
    :parameters (?h ?l ?c)
    :precondition (and (HAND ?h) (not (is-free ?h))
                       (LOCATION ?l) (not (is-drawer ?l))
                       (POT ?c) (at ?h ?c)
                       )
    :effect (and (is-free ?h) (not (at ?h ?c)) (at ?l ?c))
)

(:action open-container
    ; robot uses two hands to open the container
    :parameters (?h1 ?h2 ?c)
    :precondition (and (HAND ?h1) (not (is-free ?h1))
                       (HAND ?h2) (is-free ?h2)
                       (CONTAINER ?c) (at ?h1 ?c) (not (is-open ?c))
    )
    :effect (and (is-open ?c))
)

(:action close-container
    ; robot uses two hands to close the container
    :parameters (?h1 ?h2 ?c)
    :precondition (and (HAND ?h1) (not (is-free ?h1))
                       (HAND ?h2) (is-free ?h2)
                       (CONTAINER ?c) (at ?h1 ?c) (is-open ?c)
    )
    :effect (and (not (is-open ?c)))
)

(:action fill-water-jug
    ; Robot fills water jug to have filtered water (using two hands)
    :parameters (?h1 ?h2 ?c)
    :precondition (and (HAND ?h1) (not (is-free ?h1))
                       (HAND ?h2) (is-free ?h2)
                       (CONTAINER ?c) (for-water ?c) (at ?h1 ?c) (is-open ?c) (not (has-water ?c))
    )
    :effect (and (has-water ?c))
)

(:action unscrew-pot
    ;robot removes the top part of the pot and puts it on the table
    :parameters (?h1 ?h2 ?p)
    :precondition (and (HAND ?h1) (not (is-free ?h1))
                       (HAND ?h2) (is-free ?h2)
                       (POT ?p) (at ?h1 ?p) (is-screwed ?p)
                       )
    :effect (and (not (is-screwed ?p)))
)

(:action screw-pot
    ;robot removes the top part of the pot and puts it on the table
    :parameters (?h1 ?h2 ?p)
    :precondition (and (HAND ?h1) (not (is-free ?h1))
                       (HAND ?h2) (is-free ?h2)
                       (POT ?p) (at ?h1 ?p) (not (is-screwed ?p))
                       )
    :effect (and (is-screwed ?p))
)

(:action remove-filter
    ;robot removes filter from the moka pot
    :parameters (?h1 ?h2 ?p)
    :precondition (and (HAND ?h1) (not (is-free ?h1))
                       (HAND ?h2) (is-free ?h2)
                       (POT ?p) (at ?h1 ?p) (not (is-screwed ?p)) (has-filter ?p)
    )
    :effect (and (not (has-filter ?p)))
)

(:action put-filter-back
    ;robot puts filter to the moka pot
    :parameters (?h1 ?h2 ?p)
    :precondition (and (HAND ?h1) (not (is-free ?h1))
                       (HAND ?h2) (is-free ?h2)
                       (POT ?p) (at ?h1 ?p) (not (is-screwed ?p)) (not (has-filter ?p))
    )
    :effect (and (has-filter ?p))
)

(:action pour-water-to-the-pot
    :parameters (?h1 ?h2 ?p ?c)
    :precondition (and (HAND ?h1) (not (is-free ?h1))
                       (HAND ?h2) (not (is-free ?h2))
                       (POT ?p) (not (is-screwed ?p)) (not (has-filter ?p)) (at ?h1 ?p)
                       (CONTAINER ?c) (for-water ?c) (has-water ?c) (at ?h2 ?c) (not (is-open ?c))
    )
    :effect (and (has-water ?p))
)

(:action take-spoon
    ; one hand takes spoon
    :parameters (?h)
    :precondition (and (HAND ?h) (is-free ?h) (not (has-spoon ?h)))
    :effect (and (not (is-free ?h)) (has-spoon ?h))
)

(:action put-down-spoon
    ; one hand puts spoon down
    :parameters (?h)
    :precondition (and (HAND ?h) (not (is-free ?h)) (has-spoon ?h))
    :effect (and (not (has-spoon ?h)) (is-free ?h))
)


; COFFEE GRINDING
(:action pour-beans-to-grinder
    ; pours coffee beans to the grinder, which is always open
    :parameters (?h1 ?h2 ?l ?c)
    :precondition (and (HAND ?h1) (not (is-free ?h1))
                       (HAND ?h2) (not (is-free ?h2)) (has-spoon ?h2)
                       (LOCATION ?l) (is-grinder ?l) 
                       (CONTAINER ?c) (has-beans ?c) (at ?h1 ?c) (is-open ?c)
                       )
    :effect (and (has-beans ?l))
)

(:action grind-coffee
    ; robot clicks on container to grind coffee
    :parameters (?h ?l ?c)
    :precondition (and (HAND ?h) (is-free ?h)
                       (LOCATION ?l) (is-grinder ?l) (has-beans ?l)
                       (CONTAINER ?c) (at ?l ?c) (is-empty ?c)
    )
    :effect (and (has-coffee ?c))
)

(:action pour-coffee-to-the-pot
    :parameters (?h1 ?h2 ?c ?l ?p)
    :precondition (and (HAND ?h1) (not (is-free ?h1))
                       (HAND ?h2) (has-spoon ?h2)
                       (CONTAINER ?c) (has-coffee ?c) (is-open ?c) (at ?h1 ?c)
                       (LOCATION ?l) (is-table ?l)
                       (POT ?p) (not (is-screwed ?p)) (has-filter ?p) (at ?l ?p)
    )
    :effect (and (has-coffee ?p) (not (has-coffee ?c)) (is-empty ?c))
)

(:action distribute-coffee-evenly
    :parameters (?h1 ?h2 ?p)
    :precondition (and (HAND ?h1) (not (is-free ?h1))
                       (HAND ?h2) (has-spoon ?h2)
                       (POT ?p) (not (is-screwed ?p)) (has-filter ?p) (at ?h1 ?p) (has-coffee ?p)
                       )
    :effect (and (coffee-is-distributed-evenly ?p)  )
)


(:action ignite-heat
    :parameters (?h ?p ?l)
    :precondition (and (HAND ?h) (is-free ?h)
                       (LOCATION ?l) (is-stove ?l)
                       (POT ?p) (has-water ?p) (coffee-is-distributed-evenly ?p) (is-screwed ?p) (at ?l ?p)
    )
    :effect (and (coffee-is-ready ?p))
)

(:action pour-fresh-specialty-to-a-cup
    :parameters (?h ?p ?l ?c)
    :precondition (and (HAND ?h) (not (is-free ?h))
                       (POT ?p) (coffee-is-ready ?p) (is-screwed ?p) (at ?h ?p)
                       (LOCATION ?l) (is-table ?l)
                       (CUP ?c) (at ?l ?c) (is-empty ?c)
    )
    :effect (and (has-coffee ?c))
)

(:action add-flavor-to-your-coffee
    :parameters (?h1 ?h2 ?l ?a ?c)
    :precondition (and (HAND ?h1) (not (is-free ?h1))
                       (HAND ?h2) (has-spoon ?h2)
                       (LOCATION ?l) (is-table ?l)
                       (ADDON ?a) (at ?h1 ?a)
                       (CUP ?c) (has-coffee ?c) (at ?l ?c)
                       )
    :effect (and (has-flavor ?c ?a))
)

)

; problem
(define (problem moka_maker) (:domain moka_robo_barista_two)
(:objects 
    left_h
    right_h
    
    water_jug
    beans_jar
    coffee_mug
    
    pot
    
    drawer
    closet
    table
    grinder
    stove
    
    sugar
    
    cup
)

(:init
    
    (HAND left_h) (HAND right_h)
    (CONTAINER water_jug) (CONTAINER beans_jar) (CONTAINER coffee_mug) 
    (POT pot)
    (LOCATION drawer) (LOCATION table) (LOCATION grinder) (LOCATION stove) 
    (LOCATION closet)
    (ADDON sugar)
    (CUP cup)


    ; robot 
    (is-free left_h)
    (is-free right_h)
    
    ;Locations
    (is-drawer closet)
    (is-closed closet)
    (is-drawer drawer)
    (is-closed drawer)
    (is-table table)
    (is-grinder grinder)
    (is-stove stove)
    
    ; water jug
    (for-water water_jug)
    (at drawer water_jug)
    
    ; beans CONTAINER
    (has-beans beans_jar)
    (at drawer beans_jar)
    (at drawer coffee_mug)
    (is-empty coffee_mug)
    
    ;addons
    (at table sugar)

    ;cups
    (is-empty cup)
    (at closet cup)

    
    ;pot
    (at drawer pot)
    (has-filter pot)
    (is-screwed pot)
    
    
)

(:goal (and 
            (has-coffee cup) (has-flavor cup sugar)
            
            (at drawer coffee_mug)
            (at drawer beans_jar)
            (at table water_jug)
            (is-closed drawer)
            (is-closed closet)
            
            (is-free right_h)
            (is-free left_h)
)
)
)

; plan
1. (open-drawer drawer left_h)
   deleted: (is-closed drawer)
   goals met: 5 of 9
2. (take-pot-up-from-drawer left_h drawer pot)
   deleted: (is-free left_h) (at drawer pot)
   added: (at left_h pot)
   goals met: 4 of 9
3. (unscrew-pot left_h right_h pot)
   deleted: (is-screwed pot)
   goals met: 4 of 9
4. (remove-filter left_h right_h pot)
   deleted: (has-filter pot)
   goals met: 4 of 9
5. (put-pot-down-to left_h stove pot)
   deleted: (at left_h pot)
   added: (is-free left_h) (at stove pot)
   goals met: 5 of 9
6. (take-object-up-from-drawer left_h drawer water_jug)
   deleted: (is-free left_h) (at drawer water_jug)
   added: (at left_h water_jug)
   goals met: 4 of 9
7. (open-container left_h right_h water_jug)
   added: (is-open water_jug)
   goals met: 4 of 9
8. (fill-water-jug left_h right_h water_jug)
   added: (has-water water_jug)
   goals met: 4 of 9
9. (put-object-down-to left_h table water_jug)
   deleted: (at left_h water_jug)
   added: (is-free left_h) (at table water_jug)
   goals met: 6 of 9
10. (close-drawer drawer left_h)
   added: (is-closed drawer)
   goals met: 7 of 9
11. (open-drawer closet left_h)
   deleted: (is-closed closet)
   goals met: 6 of 9
12. (take-cup-up-from-drawer left_h closet cup)
   deleted: (is-free left_h) (at closet cup)
   added: (at left_h cup)
   goals met: 5 of 9
13. (put-cup-down-to left_h table cup)
   deleted: (at left_h cup)
   added: (is-free left_h) (at table cup)
   goals met: 6 of 9
14. (close-drawer closet left_h)
   added: (is-closed closet)
   goals met: 7 of 9
15. (open-drawer drawer left_h)
   deleted: (is-closed drawer)
   goals met: 6 of 9
16. (take-object-up-from-drawer left_h drawer coffee_mug)
   deleted: (is-free left_h) (at drawer coffee_mug)
   added: (at left_h coffee_mug)
   goals met: 4 of 9
17. (open-container left_h right_h coffee_mug)
   added: (is-open coffee_mug)
   goals met: 4 of 9
18. (put-object-down-to left_h grinder coffee_mug)
   deleted: (at left_h coffee_mug)
   added: (is-free left_h) (at grinder coffee_mug)
   goals met: 5 of 9
19. (take-object-up-from-drawer left_h drawer beans_jar)
   deleted: (is-free left_h) (at drawer beans_jar)
   added: (at left_h beans_jar)
   goals met: 3 of 9
20. (open-container left_h right_h beans_jar)
   added: (is-open beans_jar)
   goals met: 3 of 9
21. (take-spoon right_h)
   deleted: (is-free right_h)
   added: (has-spoon right_h)
   goals met: 2 of 9
22. (pour-beans-to-grinder left_h right_h grinder beans_jar)
   added: (has-beans grinder)
   goals met: 2 of 9
23. (put-object-down-to-drawer left_h drawer beans_jar)
   deleted: (at left_h beans_jar)
   added: (is-free left_h) (at drawer beans_jar)
   goals met: 4 of 9
24. (grind-coffee left_h grinder coffee_mug)
   added: (has-coffee coffee_mug)
   goals met: 4 of 9
25. (put-down-spoon right_h)
   deleted: (has-spoon right_h)
   added: (is-free right_h)
   goals met: 5 of 9
26. (take-object-up-from left_h grinder coffee_mug)
   deleted: (is-free left_h) (at grinder coffee_mug)
   added: (at left_h coffee_mug)
   goals met: 4 of 9
27. (put-object-down-to-drawer left_h drawer coffee_mug)
   deleted: (at left_h coffee_mug)
   added: (is-free left_h) (at drawer coffee_mug)
   goals met: 6 of 9
28. (close-drawer drawer left_h)
   added: (is-closed drawer)
   goals met: 7 of 9
29. (take-object-up-from left_h table water_jug)
   deleted: (is-free left_h) (at table water_jug)
   added: (at left_h water_jug)
   goals met: 5 of 9
30. (close-container left_h right_h water_jug)
   deleted: (is-open water_jug)
   goals met: 5 of 9
31. (take-pot-up-from right_h stove pot)
   deleted: (is-free right_h) (at stove pot)
   added: (at right_h pot)
   goals met: 4 of 9
32. (pour-water-to-the-pot right_h left_h pot water_jug)
   added: (has-water pot)
   goals met: 4 of 9
33. (put-object-down-to left_h table water_jug)
   deleted: (at left_h water_jug)
   added: (is-free left_h) (at table water_jug)
   goals met: 6 of 9
34. (put-filter-back right_h left_h pot)
   added: (has-filter pot)
   goals met: 6 of 9
35. (open-drawer drawer left_h)
   deleted: (is-closed drawer)
   goals met: 5 of 9
36. (take-object-up-from-drawer left_h drawer coffee_mug)
   deleted: (is-free left_h) (at drawer coffee_mug)
   added: (at left_h coffee_mug)
   goals met: 3 of 9
37. (put-pot-down-to right_h table pot)
   deleted: (at right_h pot)
   added: (is-free right_h) (at table pot)
   goals met: 4 of 9
38. (take-spoon right_h)
   deleted: (is-free right_h)
   added: (has-spoon right_h)
   goals met: 3 of 9
39. (pour-coffee-to-the-pot left_h right_h coffee_mug table pot)
   deleted: (has-coffee coffee_mug)
   added: (has-coffee pot)
   goals met: 3 of 9
40. (put-object-down-to-drawer left_h drawer coffee_mug)
   deleted: (at left_h coffee_mug)
   added: (is-free left_h) (at drawer coffee_mug)
   goals met: 5 of 9
41. (close-drawer drawer left_h)
   added: (is-closed drawer)
   goals met: 6 of 9
42. (take-pot-up-from left_h table pot)
   deleted: (is-free left_h) (at table pot)
   added: (at left_h pot)
   goals met: 5 of 9
43. (distribute-coffee-evenly left_h right_h pot)
   added: (coffee-is-distributed-evenly pot)
   goals met: 5 of 9
44. (put-down-spoon right_h)
   deleted: (has-spoon right_h)
   added: (is-free right_h)
   goals met: 6 of 9
45. (screw-pot left_h right_h pot)
   added: (is-screwed pot)
   goals met: 6 of 9
46. (put-pot-down-to left_h stove pot)
   deleted: (at left_h pot)
   added: (is-free left_h) (at stove pot)
   goals met: 7 of 9
47. (ignite-heat left_h pot stove)
   added: (coffee-is-ready pot)
   goals met: 7 of 9
48. (take-pot-up-from left_h stove pot)
   deleted: (is-free left_h) (at stove pot)
   added: (at left_h pot)
   goals met: 6 of 9
49. (pour-fresh-specialty-to-a-cup left_h pot table cup)
   added: (has-coffee cup)
   goals met: 7 of 9
50. (put-pot-down-to left_h stove pot)
   deleted: (at left_h pot)
   added: (is-free left_h) (at stove pot)
   goals met: 8 of 9
51. (take-addon-up-from left_h table sugar)
   deleted: (is-free left_h) (at table sugar)
   added: (at left_h sugar)
   goals met: 7 of 9
52. (take-spoon right_h)
   deleted: (is-free right_h)
   added: (has-spoon right_h)
   goals met: 6 of 9
53. (add-flavor-to-your-coffee left_h right_h table sugar cup)
   added: (has-flavor cup sugar)
   goals met: 7 of 9
54. (put-addon-down-to left_h table sugar)
   deleted: (at left_h sugar)
   added: (is-free left_h) (at table sugar)
   goals met: 8 of 9
55. (put-down-spoon right_h)
   deleted: (has-spoon right_h)
   added: (is-free right_h)
   goals met: 9 of 9
